Revit 2027 API
IExportContext.OnElementEnd Method
 This method marks the end of an element being exported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void OnElementEnd(
	ElementId elementId
)
Sub OnElementEnd (
	elementId As ElementId
)
void OnElementEnd(
	ElementId^ elementId
)
abstract OnElementEnd :
        elementId : ElementId -> unit
Parameters
elementId ElementId
 The Id of the element that has just been processed.
Remarks
 This method is never called for 2D export (see cref="Autodesk::Revit::DB::IExportContext2D").
See Also
Reference
IExportContext Interface
Autodesk.Revit.DB Namespace